//#include <stdio.h>
//#include <locale.h>
//
//void PrintDescending() //функция, которая выводит числа в порядке убывания
//{
//	printf("Введите три числа:\n");
//	int a, b, c; //первое, второе и третье числа
//	scanf_s("%d %d %d", &a, &b, &c);
//
//	printf("\nЧисла в порядке убывания:");
//	if (a >= b)
//	{
//		if (a >= c)
//		{
//			if (b >= c)
//			{
//				printf("\n%d %d %d\n", a, b, c); //выводит числа в порядке убывания
//			}
//			else
//			{
//				printf("\n%d %d %d\n", a, c, b); //выводит числа в порядке убывания
//			}
//		}
//		else
//		{
//			printf("\n%d %d %d\n", c, a, b); //выводит числа в порядке убывания
//		}
//	}
//	else
//	{
//		if (b >= c)
//		{
//			if (a >= c)
//			{
//				printf("\n%d %d %d\n", b, a, c); //выводит числа в порядке убывания
//			}
//			else
//			{
//				printf("\n%d %d %d\n", b, c, a); //выводит числа в порядке убывания
//			}
//		}
//		else
//		{
//			printf("\n%d %d %d\n", c, b, a); //выводит числа в порядке убывания
//		}
//	}
//}
//
//int main()
//{
//	setlocale(LC_ALL, "Rus");
//
//	PrintDescending();
//}